app/controllers/bookmarks_controller.rb

  def set_bookmark
    @bookmark = Bookmark.find(params[:id])
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]