app/controllers/bookmarks_controller.rb

  def index
    @bookmark = Bookmark.new
    if params[:search]
      @bookmarks = Bookmark.search(params[:search]).order("created_at DESC").paginate(page: params[:page], per_page: 4)
    else
      @bookmarks = Bookmark.all.paginate(page: params[:page], per_page: 4)
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE (url LIKE '%google%') ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "bookmarks" WHERE (url LIKE '%google%')
SELECT  "bookmarks".* FROM "bookmarks" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]

  def create
    @bookmark = current_user.bookmarks.create(bookmark_params)
---
INSERT INTO "bookmarks" ("url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "http://kinogo.by"], ["user_id", 1], ["created_at", "2018-05-24 18:16:24.376364"], ["updated_at", "2018-05-24 18:16:24.376364"]]

  def update
    if @bookmark.update(bookmark_params)
---
UPDATE "bookmarks" SET "url" = $1, "updated_at" = $2 WHERE "bookmarks"."id" = $3  [["url", "http://facebook.com"], ["updated_at", "2018-05-25 17:03:21.953887"], ["id", 25]]

  def destroy
    @bookmark.destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 54]]

  def set_bookmark
    @bookmark = Bookmark.find(params[:id])
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]